<a href="https://colab.research.google.com/github/StillWork/additional/blob/master/g_03_68_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# pandas
- 데이터프레임(Dataframe)과 시리즈(Series)

In [0]:
# 시리즈와 데이터프레임 두가지가 기본이다
# 자동으로 인덱스가 만들어진다

import numpy as np
import pandas as pd

In [3]:
x = {'city': ['서울', '부산', '대전', '대구', '광주'],
        'year': [2017, 2017, 2018, 2018, 2018],
        'temp': [18, 20, 19, 21, 20]}
data = pd.DataFrame(x)
data

  city  year  temp
0   서울  2017    18
1   부산  2017    20
2   대전  2018    19
3   대구  2018    21
4   광주  2018    20

In [4]:
x['city']

['서울', '부산', '대전', '대구', '광주']

In [5]:
data[['year', 'city']]

   year city
0  2017   서울
1  2017   부산
2  2018   대전
3  2018   대구
4  2018   광주

In [6]:
data.index = ['a','b','c','d','e'] ; data

  city  year  temp
a   서울  2017    18
b   부산  2017    20
c   대전  2018    19
d   대구  2018    21
e   광주  2018    20

In [7]:
data.columns = ['도시','연도','날씨'] 
data

   도시    연도  날씨
a  서울  2017  18
b  부산  2017  20
c  대전  2018  19
d  대구  2018  21
e  광주  2018  20

In [0]:
new_data = data.set_index(['도시'])

In [9]:
new_data

      연도  날씨
도시
서울  2017  18
부산  2017  20
대전  2018  19
대구  2018  21
광주  2018  20

In [10]:
data['연도']

a    2017
b    2017
c    2018
d    2018
e    2018
Name: 연도, dtype: int64

In [11]:
data.연도

a    2017
b    2017
c    2018
d    2018
e    2018
Name: 연도, dtype: int64

In [12]:
data

   도시    연도  날씨
a  서울  2017  18
b  부산  2017  20
c  대전  2018  19
d  대구  2018  21
e  광주  2018  20

In [13]:
data.loc[['a','b','c']]

   도시    연도  날씨
a  서울  2017  18
b  부산  2017  20
c  대전  2018  19

In [14]:
data

   도시    연도  날씨
a  서울  2017  18
b  부산  2017  20
c  대전  2018  19
d  대구  2018  21
e  광주  2018  20

In [0]:
# data.set_index(['도시'], inplace=True)
data = data.set_index(['도시'])

In [16]:
data

      연도  날씨
도시
서울  2017  18
부산  2017  20
대전  2018  19
대구  2018  21
광주  2018  20

In [17]:
data.loc['서울']

연도    2017
날씨      18
Name: 서울, dtype: int64

In [18]:
data.loc[['서울','부산']]

      연도  날씨
도시
서울  2017  18
부산  2017  20

In [19]:
data.iloc[-2:]

      연도  날씨
도시
대구  2018  21
광주  2018  20

In [20]:
cars = [50,40,20,30,10]
data['car'] = cars ; data

      연도  날씨  car
도시
서울  2017  18   50
부산  2017  20   40
대전  2018  19   20
대구  2018  21   30
광주  2018  20   10

In [21]:
data['horse'] = 5 ; data

      연도  날씨  car  horse
도시
서울  2017  18   50      5
부산  2017  20   40      5
대전  2018  19   20      5
대구  2018  21   30      5
광주  2018  20   10      5

In [22]:
data.car >= 30

도시
서울     True
부산     True
대전    False
대구     True
광주    False
Name: car, dtype: bool

In [23]:
data['high'] = data.car >= 30 ; data

      연도  날씨  car  horse   high
도시
서울  2017  18   50      5   True
부산  2017  20   40      5   True
대전  2018  19   20      5  False
대구  2018  21   30      5   True
광주  2018  20   10      5  False

In [24]:
data.drop('car', 1)

      연도  날씨  horse   high
도시
서울  2017  18      5   True
부산  2017  20      5   True
대전  2018  19      5  False
대구  2018  21      5   True
광주  2018  20      5  False

In [25]:
data.drop(['car', 'high'], 1)

      연도  날씨  horse
도시
서울  2017  18      5
부산  2017  20      5
대전  2018  19      5
대구  2018  21      5
광주  2018  20      5

## 람다 함수

In [0]:
f = lambda x: x.max() - x.min()

df = pd.DataFrame(np.arange(12).reshape(4, 3), 
                  columns=['A', 'B', 'C'], index=['a', 'b', 'c', 'd'])
df

   A   B   C
a  0   1   2
b  3   4   5
c  6   7   8
d  9  10  11

In [0]:
df.apply(f)

A    9
B    9
C    9
dtype: int64

In [0]:
df.apply(f, 1)

a    2
b    2
c    2
d    2
dtype: int64

## Series

In [0]:
# 파이썬 기본 타입인  딕셔너리로부터 시리즈를 만들 수 있다
dic = {'서울':800, '부산':150, '대구': 100}
dic

{'서울': 800, '부산': 150, '대구': 100}

In [0]:
s = pd.Series(dic) ; s

서울    800
부산    150
대구    100
dtype: int64